html/20231126T014659--run-flask-app__code_flask_py.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>run flask app</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">run flask app</h1>
<p>
jeigu flask runnini per "flask run", turedamas tik app.py -
nesiupdeitina browseryje po refresho, reikia restartint serveri
</p>

<p>
jeigu turi kazka tokio
</p>

<div class="org-src-container">
<pre class="src src-python">if __name__ == "__main__":
    with app.app_context():  # kad db sesiju dalykai nesusipintu
        db.create_all()  # creates db if the db doesn't already exist
    app.run(host="0.0.0.0", debug=True)
</pre>
</div>

<p>
ir paleidi appsa su
</p>

<div class="org-src-container">
<pre class="src src-pythona">python3 app.py
</pre>
</div>

<p>
tuomet refreshinimasis veikia
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-11-26 Sun 01:46</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>